schreibfaul1/ESP32-MiniWebRadio/src/common.h
        if(m_oldY && (m_oldY + 2 *m_lineHight < y)) {
            m_ra.val1 = 0;
            *m_dlnaLevel = m_oldDlnaLevel;
            if(m_currItemNr == 0) goto exit;
            if(m_currItemNr >  9) m_currItemNr -= 9;
            else m_currItemNr = 0;
            m_browseOnRelease = 4;
        }
        if(m_oldY && (m_oldY - 2* m_lineHight > y)) {
            m_ra.val1 = 0;
            *m_dlnaLevel = m_oldDlnaLevel;
            if(m_currItemNr + 9 >= m_dlnaMaxItems) goto exit;
            m_currItemNr += 9;
            m_browseOnRelease = 4;
        }

        if(m_oldX || m_oldY) goto exit;
        m_oldX = x; m_oldY = y;
        m_oldDlnaLevel = *m_dlnaLevel;
        tft.setTextColor(TFT_CYAN);
        tft.setFont(m_fontSize);
        if(*m_dlnaLevel == 0){  // server list
            tft.writeText(m_dlnaServer.friendlyName[itemListPos - 1], 20, m_y + (itemListPos) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, true, true);
            m_currDLNAsrvNr = itemListPos - 1;
            (*m_dlnaLevel) ++;
            if(m_dlnaHistory[*m_dlnaLevel].name){free(m_dlnaHistory[*m_dlnaLevel].name); m_dlnaHistory[*m_dlnaLevel].name = NULL;}
            m_dlnaHistory[*m_dlnaLevel].name = strdup(m_dlnaServer.friendlyName[itemListPos - 1]);
            m_browseOnRelease = 1;
        }
        else {  // content list
            if(itemListPos == 0){
                (*m_dlnaLevel) --;
                m_browseOnRelease = 2;
            }
            else if(startsWith(m_srvContent.itemURL[itemListPos - 1], "http")){ // is file
                if(m_srvContent.isAudio[itemListPos - 1]){
                    sprintf(buff, "%s",m_srvContent.title[itemListPos - 1]);
                    tft.writeText(buff, 20, m_y + (itemListPos) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, true, true);
                    m_ra.arg1 = m_srvContent.itemURL[itemListPos - 1]; // url --> connecttohost()
                    m_ra.arg2 = m_srvContent.title[itemListPos - 1];   // filename --> showFileName()
                    if(m_ra.arg1 && m_ra.arg2) m_ra.val1 = 1;
                    m_browseOnRelease = 0;
                }
            }
            else{ // is folder
                sprintf(buff, "%s (%d)",m_srvContent.title[itemListPos - 1], m_srvContent.childCount[itemListPos - 1]);
                (*m_dlnaLevel) ++;
                 tft.writeText(buff, 20, m_y + (itemListPos) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, true, true);
                if(m_dlnaHistory[*m_dlnaLevel].objId){free(m_dlnaHistory[*m_dlnaLevel].objId); m_dlnaHistory[*m_dlnaLevel].objId = NULL;}
                m_dlnaHistory[*m_dlnaLevel].objId = strdup(m_srvContent.objectId[itemListPos -1]);
                if(m_dlnaHistory[*m_dlnaLevel].name){free(m_dlnaHistory[*m_dlnaLevel].name); m_dlnaHistory[*m_dlnaLevel].name = NULL;}
                m_dlnaHistory[*m_dlnaLevel].name = strdup(m_srvContent.title[itemListPos - 1]);
                m_browseOnRelease = 3;
            }
        }
exit:
        if(buff){free(buff); buff = NULL;}
        return;
    }
};
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class fileList{
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    char*       m_name = NULL;
    char*       m_pathBuff = NULL;
public:
    fileList(const char* name){
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("alarmClock");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
    }
    ~fileList(){
        if(m_name){free(m_name); m_name = NULL;}
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_enabled = false;
    }
    void show(){
        m_clicked = false;
        m_enabled = true;
        ;
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        return true;
    }
private:
    void audioFileslist(){
        // auto triangleUp = [&](int16_t x, int16_t y, uint8_t s) { tft.fillTriangle(x + s, y + 0, x + 0, y + 2 * s, x + 2 * s, y + 2 * s, TFT_RED); };
        // auto triangleDown = [&](int16_t x, int16_t y, uint8_t s) { tft.fillTriangle(x + 0, y + 0, x + 2 * s, y + 0, x + s, y + 2 * s, TFT_RED); };

    //    clearWithOutHeaderFooter();
    //    if(_SD_content.size() < 10) fileListNr = 0;
        // showHeadlineItem(AUDIOFILESLIST);
        // tft.setFont(_fonts[0]);
        // uint8_t lineHight = _winWoHF.h / 10;
        // tft.setTextColor(TFT_ORANGE);
        // tft.writeText(_curAudioFolder.c_str(), 10, _winHeader.h, _dispWidth - 10, lineHight, TFT_ALIGN_LEFT, true, true);
        // tft.setTextColor(TFT_WHITE);
        // for(uint8_t pos = 1; pos < 10; pos++) {
    //        if(pos == 1 && fileListNr > 0) {
    //            tft.setTextColor(TFT_AQUAMARINE);
    //            triangleUp(0, _winHeader.h + (pos * lineHight), lineHight / 3.5);
    //        }
    //        if(pos == 9 && fileListNr + 9 < _SD_content.size()) {
            //     tft.setTextColor(TFT_AQUAMARINE);
            //     triangleDown(0, _winHeader.h + (pos * lineHight), lineHight / 3.5);
            // }
            // if(fileListNr + pos > _SD_content.size()) break;
            // if(indexOf(_SD_content[pos + fileListNr - 1], "\033[", 0) == -1) tft.setTextColor(TFT_GRAY); // is folder
            // else tft.setTextColor(TFT_WHITE);                                                            // is file
            // tft.writeText(_SD_content[pos + fileListNr - 1], 20, _winFooter.h + (pos)*lineHight, _dispWidth - 20, lineHight, TFT_ALIGN_LEFT, true, true);
    //    }
    //    _timeCounter.timer = 10;
    //    _timeCounter.factor = 1.0;
    }
    void hasClicked(uint16_t x, uint16_t y){
        ;
    }
};
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class stationsList{
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    char*       m_name = NULL;
    char*       m_pathBuff = NULL;
public:
    stationsList(const char* name){
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("alarmClock");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
    }
    ~stationsList(){
        if(m_name){free(m_name); m_name = NULL;}
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_enabled = false;
    }
    void show(){
        m_clicked = false;
        m_enabled = true;
        ;
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        return true;
    }
};
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
